gab-k/FlexAudioLink/firmware/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 25.09.10
board: FRDM-RW612
pin_labels:
- {pin_num: M2, pin_signal: GPIO_11, label: 'J1[6]/WAKEUP_BTN', identifier: WAKEUP;WAKEUP_BTN}
- {pin_num: L7, pin_signal: GPIO_5, label: 'J1[7]/MCLK', identifier: MCLKOUT}
- {pin_num: G13, pin_signal: GPIO_42, label: 'J4[2]', identifier: SOFTAP}
- {pin_num: H10, pin_signal: GPIO_45, label: 'J4[6]', identifier: LATENCY}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitSWD_DEBUGPins();
    BOARD_InitLEDPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: F8, peripheral: FLEXCOMM0, signal: I2S_SCK, pin_signal: GPIO_4}
  - {pin_num: C13, peripheral: FLEXCOMM0, signal: I2S_WS, pin_signal: GPIO_3}
  - {pin_num: F10, peripheral: FLEXCOMM0, signal: I2S_DATA, pin_signal: GPIO_2}
  - {pin_num: L7, peripheral: CLKCTL1, signal: MCLK, pin_signal: GPIO_5, direction: OUTPUT}
  - {pin_num: M2, peripheral: GPIO, signal: 'PIO0, 11', pin_signal: GPIO_11, identifier: WAKEUP_BTN, direction: INPUT}
  - {pin_num: G13, peripheral: GPIO, signal: 'PIO1, 10', pin_signal: GPIO_42, direction: INPUT, pull_up_down: down}
  - {pin_num: H10, peripheral: GPIO, signal: 'PIO1, 13', pin_signal: GPIO_45, direction: OUTPUT, pull_up_down: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Enables the clock for the GPIO0 module */
    GPIO_PortInit(GPIO, 0);
    /* Enables the clock for the GPIO1 module */
    GPIO_PortInit(GPIO, 1);

    gpio_pin_config_t WAKEUP_BTN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_11 (pin M2)  */
    GPIO_PinInit(BOARD_INITPINS_WAKEUP_BTN_GPIO, BOARD_INITPINS_WAKEUP_BTN_PORT, BOARD_INITPINS_WAKEUP_BTN_PIN, &WAKEUP_BTN_config);

    gpio_pin_config_t SOFTAP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin G13)  */
    GPIO_PinInit(BOARD_INITPINS_SOFTAP_GPIO, BOARD_INITPINS_SOFTAP_PORT, BOARD_INITPINS_SOFTAP_PIN, &SOFTAP_config);

    gpio_pin_config_t LATENCY_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_13 (pin H10)  */
    GPIO_PinInit(BOARD_INITPINS_LATENCY_GPIO, BOARD_INITPINS_LATENCY_PORT, BOARD_INITPINS_LATENCY_PIN, &LATENCY_config);
    /* Initialize FC0_I2S functionality on pin GPIO_4, GPIO_3, GPIO_2 (pin F8_C13_F10) */
    IO_MUX_SetPinMux(IO_MUX_FC0_I2S);
    /* Initialize MCLK functionality on pin GPIO_5 (pin L7) */
    IO_MUX_SetPinMux(IO_MUX_MCLK);
    /* Initialize GPIO11 functionality on pin GPIO_11 (pin M2) */
    IO_MUX_SetPinMux(IO_MUX_GPIO11);
    /* Initialize GPIO42 functionality on pin GPIO_42 (pin G13) */
    IO_MUX_SetPinMux(IO_MUX_GPIO42);
    /* Initialize GPIO45 functionality on pin GPIO_45 (pin H10) */
    IO_MUX_SetPinMux(IO_MUX_GPIO45);
    /* Set GPIO_42 (pin G13) configuration - Enable pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(BOARD_INITPINS_SOFTAP_GPIO_PIN, IO_MUX_PinConfigPullDown);
    /* Set GPIO_45 (pin H10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(BOARD_INITPINS_LATENCY_GPIO_PIN, IO_MUX_PinConfigNoPull);

    SYSCTL1->MCLKPINDIR = ((SYSCTL1->MCLKPINDIR &
                            /* Mask bits to zero which are setting */
                            (~(SYSCTL1_MCLKPINDIR_MCLKPINDIR_MASK)))

                           /* mclk direction control: MCLK is in the output direction. */
                           | SYSCTL1_MCLKPINDIR_MCLKPINDIR(MCLKPINDIR_MCLKPINDIR_OUTPUT_DIRECTION));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: F6, peripheral: FLEXCOMM3, signal: USART_TXD, pin_signal: GPIO_26}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24, GPIO_26 (pin E5_F6) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWD_DEBUGPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: G5, peripheral: SWD, signal: CLK, pin_signal: GPIO_13}
  - {pin_num: K4, peripheral: SWD, signal: IO, pin_signal: GPIO_14}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSWD_DEBUGPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitSWD_DEBUGPins(void)
{

    MCI_IO_MUX->C_TIMER_IN = ((MCI_IO_MUX->C_TIMER_IN &
                               /* Mask bits to zero which are setting */
                               (~(MCI_IO_MUX_C_TIMER_IN_CT_INP3_SEL_MASK | MCI_IO_MUX_C_TIMER_IN_CT_INP4_SEL_MASK)))

                              /* sel GPIO-13 as ct_inp3: 0x00u */
                              | MCI_IO_MUX_C_TIMER_IN_CT_INP3_SEL(0x00u)
                              /* sel GPIO-14 as ct_inp4: 0x00u */
                              | MCI_IO_MUX_C_TIMER_IN_CT_INP4_SEL(0x00u));

    MCI_IO_MUX->C_TIMER_OUT = ((MCI_IO_MUX->C_TIMER_OUT &
                                /* Mask bits to zero which are setting */
                                (~(MCI_IO_MUX_C_TIMER_OUT_CT0MAT3_SEL_MASK | MCI_IO_MUX_C_TIMER_OUT_CT1MAT0_SEL_MASK)))

                               /* sel GPIO-13 as ct0mat3: 0x00u */
                               | MCI_IO_MUX_C_TIMER_OUT_CT0MAT3_SEL(0x00u)
                               /* sel GPIO-14 as ct1mat0: 0x00u */
                               | MCI_IO_MUX_C_TIMER_OUT_CT1MAT0_SEL(0x00u));

    MCI_IO_MUX->FC2 =
        ((MCI_IO_MUX->FC2 &
          /* Mask bits to zero which are setting */
          (~(MCI_IO_MUX_FC2_SEL_FC2_I2C_MASK | MCI_IO_MUX_FC2_SEL_FC2_I2S_MASK | MCI_IO_MUX_FC2_SEL_FC2_SPI_MASK | MCI_IO_MUX_FC2_SEL_FC2_I2S_DATA_ONLY_MASK | MCI_IO_MUX_FC2_SEL_FC2_USART_DATA_MASK)))

         /* flexcomm2:select GPIO-13/14 as i2c function: 0x00u */
         | MCI_IO_MUX_FC2_SEL_FC2_I2C(0x00u)
         /* flexcomm2:select GPIO-13/14/15 as i2s function: 0x00u */
         | MCI_IO_MUX_FC2_SEL_FC2_I2S(0x00u)
         /* flexcomm2:select GPIO-13/14/15/16 as spi function: 0x00u */
         | MCI_IO_MUX_FC2_SEL_FC2_SPI(0x00u)
         /* flexcomm2:select GPIO-13 as i2s data function: 0x00u */
         | MCI_IO_MUX_FC2_SEL_FC2_I2S_DATA_ONLY(0x00u)
         /* flexcomm2:select GPIO-13/14 as usart rxd/txd: 0x00u */
         | MCI_IO_MUX_FC2_SEL_FC2_USART_DATA(0x00u));

    MCI_IO_MUX->GPIO_GRP0 = ((MCI_IO_MUX->GPIO_GRP0 &
                              /* Mask bits to zero which are setting */
                              (~(MCI_IO_MUX_GPIO_GRP0_SEL_13_MASK | MCI_IO_MUX_GPIO_GRP0_SEL_14_MASK)))

                             /* pio0[31:0] selection, high valid; sel[i]->pio0[i]->GPIO[i]: 0x00u */
                             | MCI_IO_MUX_GPIO_GRP0_SEL(0x00u));

    SOCCTRL->MCI_IOMUX_EN0 = ((SOCCTRL->MCI_IOMUX_EN0 &
                               /* Mask bits to zero which are setting */
                               (~(SOCCIU_MCI_IOMUX_EN0_EN_21_0_13_MASK | SOCCIU_MCI_IOMUX_EN0_EN_21_0_14_MASK)))

                              /* Bitwise enable control for mci_io_mux GPIO[21:0]: 0x00u */
                              | SOCCIU_MCI_IOMUX_EN0_EN_21_0(0x00u));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: M1, peripheral: GPIO, signal: 'PIO0, 0', pin_signal: GPIO_0, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: N2, peripheral: GPIO, signal: 'PIO0, 1', pin_signal: GPIO_1, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: N8, peripheral: GPIO, signal: 'PIO0, 12', pin_signal: GPIO_12, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitLEDPins(void)
{
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_HsGpio0);

    gpio_pin_config_t LED_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin M1)  */
    GPIO_PinInit(BOARD_INITLEDPINS_LED_BLUE_GPIO, BOARD_INITLEDPINS_LED_BLUE_PORT, BOARD_INITLEDPINS_LED_BLUE_PIN, &LED_BLUE_config);

    gpio_pin_config_t LED_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin N2)  */
    GPIO_PinInit(BOARD_INITLEDPINS_LED_RED_GPIO, BOARD_INITLEDPINS_LED_RED_PORT, BOARD_INITLEDPINS_LED_RED_PIN, &LED_RED_config);

    gpio_pin_config_t LED_GREEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_12 (pin N8)  */
    GPIO_PinInit(BOARD_INITLEDPINS_LED_GREEN_GPIO, BOARD_INITLEDPINS_LED_GREEN_PORT, BOARD_INITLEDPINS_LED_GREEN_PIN, &LED_GREEN_config);
    /* Initialize GPIO0 functionality on pin GPIO_0 (pin M1) */
    IO_MUX_SetPinMux(IO_MUX_GPIO0);
    /* Initialize GPIO1 functionality on pin GPIO_1 (pin N2) */
    IO_MUX_SetPinMux(IO_MUX_GPIO1);
    /* Initialize GPIO12 functionality on pin GPIO_12 (pin N8) */
    IO_MUX_SetPinMux(IO_MUX_GPIO12);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
